def bot_token() -> str:
    return "6639482165:AAGxgzA0LQU0wN6AbzVJU7lvXjGTPTqskmw"


def parse_mode() -> str:
    return "HTML"


def text_tell_about_your_problem() -> str:
    return "Сообщить о неисправности/проблеме (Для специалистов)"


def text_register_for_admins() -> str:
    return "Зарегистрироваться(Для администраторов)"


def choose_button() -> str:
    return "Выберите"


def text_incorrect_text() -> str:
    return "Если вы хотите сообщить о неполадках, следуйте кнопкам в меню"


def text_incorrect_image() -> str:
    return "Этот бот не для того, чтобы отправлять стикеры."


def text_incorrect_gif() -> str:
    return "Этот бот не для того, чтобы отправлять Гиф-файлы."


def get_districts():
    return ("Контакт Центр|12452124",
            "Отдел 'Мои документы' Беловский район|12452124",
            "Отдел 'Мои документы' Гурьевский район|12452124",
            "Отдел 'Мои документы' Ижморский район|12452124",
            "Отдел 'Мои документы' Кемеровский район|12452124",
            "Отдел 'Мои документы' Крапивинский район|12452124",
            "Отдел 'Мои документы' Краснобродского городского округа|12452124",
            "Отдел 'Мои документы' Ленинск-Кузнецкий район|12452124",
            "Отдел 'Мои документы' Мариинский район|12452124",
            "Отдел 'Мои документы' Новокузнецкий район|12452124",
            "Отдел 'Мои документы' Прокопьевский район|12452124",
            "Отдел 'Мои документы' Промышленновский район|12452124",
            "Отдел 'Мои документы' Таштагольский район|12452124",
            "Отдел 'Мои документы' Тисульский район|12452124",
            "Отдел 'Мои документы' Топкинский район|12452124",
            "Отдел 'Мои документы' Тяжинский район|12452124",
            "Отдел 'Мои документы' Чебулинский район|12452124",
            "Отдел 'Мои документы' Юргинский район|12452124",
            "Отдел 'Мои документы' Яйский район|12452124",
            "Отдел 'Мои документы' Яшкинский район|12452124",
            "Отдел 'Мои документы' город Анжеро-Судженск|12452124",
            "Отдел 'Мои документы' город Белово|12452124",
            "Отдел 'Мои документы' город Березовский|12452124",
            "Отдел 'Мои документы' город Калтан|12452124",
            "Отдел 'Мои документы' город Кемерово ЦОУ на Молодежном|12452124",
            "Отдел 'Мои документы' город Кемерово, бр Пионерский, 3|12452124",
            "Отдел 'Мои документы' город Кемерово, ул Кирова, 41а|12452124",
            "Отдел 'Мои документы' город Кемерово, ул Рекордная, 2в|12452124",
            "Отдел 'Мои документы' город Киселевск|12452124",
            "Отдел 'Мои документы' город Ленинск-Кузнецкий|12452124",
            "Отдел 'Мои документы' город Междуреченск|12452124",
            "Отдел 'Мои документы' город Мыски|12452124",
            "Отдел 'Мои документы' город Новокузнецк, ул Братьев Гаденовых, 8|12452124",
            "Отдел 'Мои документы' город Новокузнецк, ул Кутузова, 17а|12452124",
            "Отдел 'Мои документы' город Новокузнецк, ул Новоселов, 37|12452124",
            "Отдел 'Мои документы' город Новокузнецк, ул Павловского, 21а|12452124",
            "Отдел 'Мои документы' город Новокузнецк, ул Франкфурта, 9А|12452124",
            "Отдел 'Мои документы' город Осинники|12452124",
            "Отдел 'Мои документы' город Полысаево|12452124",
            "Отдел 'Мои документы' город Прокопьевск, ул Институтская, 15|12452124",
            "Отдел 'Мои документы' город Прокопьевск, ул Комсомольская, 3|12452124",
            "Отдел 'Мои документы' город Тайга|12452124",
            "Отдел 'Мои документы' город Юрга|12452124",
            "ТЕСТОВЫЙ МФЦ КЕМЕРОВО|12452124")
